package backend.academy.utils;

import java.io.PrintStream;
import java.util.List;

public final class Message {

    static final List<String> STEPS = List.of(
        """
             _______                                            \s
             \\   / /                                            \s
              \\_/ /                                             \s
              |/|/                                              \s
              |/|                                               \s
              |/|                                               \s
              |/|                                               \s
              |/|                                               \s
              |/|                                               \s
              |/|                                               \s
              |/|                                               \s
              |/|    [TT]                                       \s
              |/|     \\ \\                                       \s
              |/|    __\\_\\__                                    \s
              |/|___|\\\\\\\\\\\\\\|___________________________________\s
              |/|_______________________________________________|
              /__\\                                         /__\\ \s
             /____\\                                       /____\\\s
            """,
        """
             _____________________________________________      \s
             \\   / /______________________________________|     \s
              \\_/ /                                             \s
              |/|/                                              \s
              |/|                                               \s
              |/|                                               \s
              |/|                                               \s
              |/|                                               \s
              |/|                                               \s
              |/|                                               \s
              |/|                                               \s
              |/|    [TT]                                       \s
              |/|     \\ \\                                       \s
              |/|    __\\_\\__                                    \s
              |/|___|\\\\\\\\\\\\\\|___________________________________\s
              |/|_______________________________________________|
              /__\\                                         /__\\ \s
             /____\\                                       /____\\\s
            """,

        """
             _____________________________/{}\\____________      \s
             \\   / /______________________|{}|____________|     \s
              \\_/ /                       \\{}/                  \s
              |/|/                         {}                   \s
              |/|                          {}                   \s
              |/|                          /\\                   \s
              |/|                         /  \\                  \s
              |/|                         \\__/                  \s
              |/|                                               \s
              |/|                                               \s
              |/|                                               \s
              |/|    [TT]                                       \s
              |/|     \\ \\                                       \s
              |/|    __\\_\\__                                    \s
              |/|___|\\\\\\\\\\\\\\|___________________________________\s
              |/|_______________________________________________|
              /__\\                                         /__\\ \s
             /____\\                                       /____\\\s
            """,

        """
             _____________________________/{}\\____________      \s
             \\   / /______________________|{}|____________|     \s
              \\_/ /                       \\{}/                  \s
              |/|/                         {}/\\_/\\              \s
              |/|                          {/ O O \\             \s
              |/|                           \\ >Y< /             \s
              |/|                            \\_-_/              \s
              |/|                            (|_|)              \s
              |/|                                               \s
              |/|                                               \s
              |/|                                               \s
              |/|    [TT]                                       \s
              |/|     \\ \\                                       \s
              |/|    __\\_\\__                                    \s
              |/|___|\\\\\\\\\\\\\\|___________________________________\s
              |/|_______________________________________________|
              /__\\                                         /__\\ \s
             /____\\                                       /____\\\s
            """,

        """
             _____________________________/{}\\____________      \s
             \\   / /______________________|{}|____________|     \s
              \\_/ /                       \\{}/                  \s
              |/|/                         {}/\\_/\\              \s
              |/|                          {/ O O \\             \s
              |/|                           \\ >Y< /             \s
              |/|                            \\_-_/              \s
              |/|                            (|_|)              \s
              |/|                            Y---Y              \s
              |/|                            |WWW|              \s
              |/|                            Y___Y              \s
              |/|    [TT]                                       \s
              |/|     \\ \\                                       \s
              |/|    __\\_\\__                                    \s
              |/|___|\\\\\\\\\\\\\\|___________________________________\s
              |/|_______________________________________________|
              /__\\                                         /__\\ \s
             /____\\                                       /____\\\s
            """,

        """
             _____________________________/{}\\____________      \s
             \\   / /______________________|{}|____________|     \s
              \\_/ /                       \\{}/                  \s
              |/|/                         {}/\\_/\\              \s
              |/|                          {/ O O \\             \s
              |/|                           \\ >Y< /             \s
              |/|                            \\_-_/              \s
              |/|                            (|_|)              \s
              |/|                          //Y---Y\\\\            \s
              |/|                         // |WWW| \\\\           \s
              |/|                       QQQ  Y___Y  QQQ         \s
              |/|    [TT]                                       \s
              |/|     \\ \\                                       \s
              |/|    __\\_\\__                                    \s
              |/|___|\\\\\\\\\\\\\\|___________________________________\s
              |/|_______________________________________________|
              /__\\                                         /__\\ \s
             /____\\                                       /____\\\s
            """,

        """
             _____________________________/{}\\____________      \s
             \\   / /______________________|{}|____________|     \s
              \\_/ /                       \\{}/                  \s
              |/|/                         {}/\\_/\\              \s
              |/|                          {/ O O \\             \s
              |/|                           \\ >Y< /             \s
              |/|                            \\_-_/              \s
              |/|                            (|_|)              \s
              |/|                          //Y---Y\\\\            \s
              |/|                         // |WWW| \\\\           \s
              |/|                       QQQ  Y___Y  QQQ         \s
              |/|    [TT]                   //   \\\\             \s
              |/|     \\ \\                  WW     WW            \s
              |/|    __\\_\\__               WW     WW            \s
              |/|___|\\\\\\\\\\\\\\|_____________QQQ ____QQQ __________\s
              |/|_______________________________________________|
              /__\\                                         /__\\ \s
             /____\\                                       /____\\\s
            """,

        """
             _____________________________/{}\\____________      \s
             \\   / /______________________|{}|____________|     \s
              \\_/ /                       \\{}/                  \s
              |/|/                         {}/\\_/\\              \s
              |/|                          {/ * * \\             \s
              |/|                           \\ >Y< /             \s
              |/|                            \\_U_/              \s
              |/|                            (|_|)              \s
              |/|                          //Y---Y\\\\            \s
              |/|                         // |WWW| \\\\           \s
              |/|                       QQQ  Y___Y  QQQ         \s
              |/|       [TT]                //   \\\\             \s
              |/|       / /                WW     WW            \s
              |/|    __/_/__               WW     WW            \s
              |/|___|\\\\\\\\\\\\\\|__________   QQQ     QQQ  _________\s
              |/|______________________\\\\             //________|
              /__\\                      \\\\           //    /__\\ \s
             /____\\                      \\\\         //    /____\\\s
            """
    );

    static final PrintStream OUT = System.out;

    private Message() {
    }

    public static void displayStep(int step) {
        if (step < 0 || step >= STEPS.size()) {
            OUT.println(STEPS.getLast());
        } else {
            OUT.printf(STEPS.get(step));
        }
    }

    public static void displayLives(int remainingLives) {
        OUT.printf("%nОсталось жизней: " + ANSI.RED);
        for (int i = 0; i < remainingLives; i++) {
            OUT.print("❤ ");
        }
        if (remainingLives <= 0) {
            OUT.printf("(0)%s", ANSI.RESET);
        } else {
            OUT.printf("(%d)%s", remainingLives, ANSI.RESET);
        }
    }

    public static void displayCurrentState(String currentAnswerState) {
        OUT.printf("%nСлово: %s", ANSI.GREEN + currentAnswerState + ANSI.RESET);
    }

    public static void displayUsedLetters(String usedLetters) {
        OUT.printf("%nИспользованные буквы: %s", ANSI.YELLOW + usedLetters + ANSI.RESET);
    }

    public static void displayHint(String hint) {
        if (hint.isEmpty()) {
            OUT.printf("%nДля включения подсказки введите 'h' или 'help'");
        } else {
            OUT.printf("%nПодсказка: %s", ANSI.GREEN + hint + ANSI.RESET);
        }
    }

    public static void win() {
        OUT.printf(ANSI.GREEN + "%n%nПоздравляем! Вы угадали слово!%n" + ANSI.RESET);
    }

    public static void lose(String word) {
        OUT.printf(ANSI.RED + "%n%nИгра окончена! Вы проиграли!%n" + ANSI.RESET);
        OUT.printf("%nЗагаданное слово: %s%n", ANSI.GREEN + word + ANSI.RESET);
    }

    public static void success() {
        OUT.printf(ANSI.GREEN +  "%nУспех! Вы угадали букву!%n" + ANSI.RESET);
    }

    public static void failure() {
        OUT.printf(ANSI.RED + "%nПровал! Вы не угадали букву!%n" + ANSI.RESET);
    }

}
